GT2/RANS/KEpsilon_lowRE_V2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0   1) 		//0
    (2  0   1) 		//1
    (2  0.1 1) 		//0
    (0  0.1 1) 		//1
    
    (0  0   0) 		//0
    (2  0   0) 		//1
    (2  0.1 0) 		//0
    (0  0.1 0) 		//1

    (-0.33333  0.1 0) 	//0
    (-0.33333  0.1 1) 	//1
    (-0.33333  0   0) 	//0
    (-0.33333  0   1) 	//1

    (2    	1 1)
    (0    	1 1)
    (-0.33333 	1 1)
    (-0.33333 	1 0)
    (0    	1 0)
    (2    	1 0)

);

blocks
(
/*
    hex (0 1 5 4 3 2 6 7) 	(100 	1 225) simpleGrading (20 	1 500)
    hex (11 0 4 10 9 3 7 8) 	(20 	1 225) simpleGrading (0.05 	1 500)
    hex (9 3 7 8 14 13 16 15) 	(20 	1  10) simpleGrading (0.05 	1 20)
    hex (3 2 6 7 13 12 17 16) 	(100 	1  10) simpleGrading (20 	1 20)
*/

    hex (0 1 5 4 3 2 6 7) 	(100 	1 50)  simpleGrading (20 	1 5)
    hex (11 0 4 10 9 3 7 8) 	(10 	1 50)  simpleGrading (0.05 	1 5)
    hex (9 3 7 8 14 13 16 15) 	(10 	1 18)  simpleGrading (0.05 	1 40)
    hex (3 2 6 7 13 12 17 16) 	(100 	1 18)  simpleGrading (20 	1 40)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (10 11 9 8)
            (8 9 14 15)
        );
    }
    top
    {
        type patch;
        faces
        (
		(15 14 13 16)
		(16 13 12 17)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (2 6 17 12)
        );
    }
    
    slipsurface
    {
        type patch;
        faces
        (
            (11 10 4 0)
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    
    frontandback
    {
        type empty;
        faces
        (
            (0 1 2 3)
	    (5 4 7 6)
            (11 0 3 9)
	    (4 10 8 7)
            (9 3 13 14)
	    (3 2 12 13)
	    (6 7 16 17)
 	    (7 8 15 16)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
